MAVProxyUser/MITCheetahSTM31MP1-Claude/stm32mp1/gazebo/mit_sim_main.cpp
  // $WP_DASH=<metres>: append a straight finishing sprint after the loop
  // above closes, continuing along whatever heading the final leg left the
  // dog on. This is the 100 m dash as a FINISH, not a standalone course - the
  // dog proves it can corner the whole loop, then gets to show what its gait
  // does in a straight line once there is nothing left to turn for.
  //
  // Per direct instruction, the handoff between loop and dash is not just a
  // waypoint change: the dog stops, lies down, and stands back up before the
  // sprint - the same lie-down/stand-up the QA ladder already rehearses at
  // the true end of every mission (see the END-OF-MISSION SEQUENCE below),
  // just run once more in the middle instead of only at the finish.
  // The dash target is always the LAST waypoint appendDash produced -
  // one point on an already-closed course (star/oval/atom all close their
  // own stroke now), two (return-to-wp00, then the sprint) on an open one.
  // The interlude fires once nav advances ONTO the dash point, i.e. the
  // dog has genuinely closed the shape before it stops and lies down.
  const int loop_wp_count = nav.count();
  bool dash_pending = false;
  if (getenv("WP_DASH")) {
    nav.appendDash(atof(getenv("WP_DASH")), vx);
    dash_pending = nav.count() > loop_wp_count;
  }
  const int dash_wp_index = nav.count() - 1;

  if (getenv("WP_ACCEPT"))   nav.accept_radius = atof(getenv("WP_ACCEPT"));
  // See WaypointNav.hpp's field comment: WP_ACCEPT also sizes the
  // BodyPathPlanner cornering corridor, so a course tuned for tight
  // corners "arrives" at EVERY waypoint - including the mission-end /
  // loop-closure one - a full WP_ACCEPT short of its literal coordinate.
  // Invisible mid-course (the next leg starts regardless); a visible gap
  // on a closed course's own flown-trail plot, since there is no next leg
  // to cover it. Opt-in, off by default (-1) so nothing changes unless a
  // recipe asks for it.
  if (getenv("WP_FINAL_ACCEPT")) nav.final_accept_radius = atof(getenv("WP_FINAL_ACCEPT"));
  if (getenv("WP_LOOP"))     nav.loop = true;
  // The MPC trot turns far harder than the crawl, which is what max_yawrate was
  // sized for (0.7 rad/s was "what the crawl can actually deliver").
  nav.max_yawrate = getenv("WP_MAX_YAWRATE") ? atof(getenv("WP_MAX_YAWRATE")) : 1.2f;
  nav.kp_heading  = getenv("WP_KP_HEADING")  ? atof(getenv("WP_KP_HEADING"))  : 2.2f;
  // Dynamic gaits arc through corners; they fall over trying to pivot in them.
  nav.turn_speed_floor = getenv("WP_TURN_FLOOR") ? atof(getenv("WP_TURN_FLOOR")) : 0.65f;

  // YAW SIGN: +1, and this was MEASURED, not reasoned. The old default of -1
  // captured 1 of 5 waypoints and never finished a mission; +1 captures 5 of 5
  // and completes the 100 m star in 46.5 s. Same binary, same run, one flag.
  //
  // Why -1 looked right and was wrong: the comment here used to say "MIT's yaw
  // rate is CCW-positive, nav's is compass-sense, so negate". Both halves are
  // true, but the chain has a THIRD negation in it -
  // `DesiredStateCommand.cpp` does `joystickRight[0] *= -1` (upstream MIT, and
  // correct: right stick right should turn the robot right). Two negations
  // cancel, so negating here inverted the steering and the robot turned away
  // from every waypoint. A sign argued from two of three terms is a guess.
  const float yaw_sign = getenv("WP_YAW_SIGN") ? atof(getenv("WP_YAW_SIGN")) : 1.f;

  /*
   * $WP_PLANNER=1 swaps the pure-pursuit follower for the Apollo-derived
   * planner: the waypoint polyline is rounded into fillet arcs, curvature gives
   * v_max(s) = sqrt(a_lat/kappa), and forward/backward accel passes make the
   * braking start BEFORE the corner instead of during it. The heuristic it
   * replaces (WP_TURN_FLOOR) completes 2 runs in 3 and fails badly if tuned any
   * deeper, which is what a hand-picked constant tends to do.
   */
  const bool use_planner = getenv("WP_PLANNER") && atoi(getenv("WP_PLANNER")) != 0;
  const bool  use_analyzer = getenv("WP_ANALYZER") && atoi(getenv("WP_ANALYZER")) != 0;
  const float analyzer_lead = getenv("WP_ANALYZER_LEAD") ? atof(getenv("WP_ANALYZER_LEAD")) : 4.0f;

  planning::BodyPathPlanner planner;
  planning::MissionAnalyzer analyzer;
  // Stop coordinates, kept for the nav loop's "no gait changes inside a
  // stop's braking zone" hold (see the gait-change gate below). [0] = the
  // dash-interlude closure (valid while dash_pending), [1] = the final
  // waypoint (always a stop - the end-of-mission lie-down).
  float hold_stop_n[2] = {0, 0}, hold_stop_e[2] = {0, 0};
  if (use_planner) {
    // The path must START WHERE THE ROBOT IS. Building it from the waypoints
    // alone begins it at wp00, 10.5 m away, so the follower spent the whole
    // mission chasing a path it was never on: 75.1 m of path (4 legs) instead
    // of 93 m (5), and 0 of 5 waypoints. The robot sits at the local-frame
    // origin when the GPS datum is taken, so (0,0) is the true first point.
    std::vector<double> wx{0.0}, wy{0.0};
    for (int i = 0; i < nav.count(); ++i) {
      wx.push_back(nav.waypoint(i).north);
      wy.push_back(nav.waypoint(i).east);
    }
    planning::BodyLimits lim;
    lim.v_cruise  = vx;
    lim.a_lat_max = getenv("WP_ALAT") ? atof(getenv("WP_ALAT")) : 2.5;

    lim.yaw_rate_max = nav.max_yawrate;
    lim.track_lag_s  = getenv("WP_LAG") ? atof(getenv("WP_LAG")) : 1.2;
    planner.setLimits(lim);
    if (getenv("WP_ALON")) planner.setAlonExplicit(atof(getenv("WP_ALON")));
    if (getenv("WP_AACC")) { auto L=planner.limits(); L.a_accel_max=atof(getenv("WP_AACC")); planner.setLimits(L); }
    if (getenv("WP_TURN_SOFT")) { auto L=planner.limits(); L.turn_soft=atof(getenv("WP_TURN_SOFT")); planner.setLimits(L); }
    if (getenv("WP_TURN_HARD")) { auto L=planner.limits(); L.turn_hard=atof(getenv("WP_TURN_HARD")); planner.setLimits(L); }
    if (getenv("WP_CSCALE"))    { auto L=planner.limits(); L.corner_scale_min=atof(getenv("WP_CSCALE")); planner.setLimits(L); }
    // Same turn_soft/turn_hard grading, applied to the fillet's geometric
    // corridor instead of the lateral-accel budget - shrinks how far an
    // acute corner's rounded arc misses the true vertex by. See the field
    // comment on BodyLimits::corridor_scale_min.
    if (getenv("WP_CORRIDOR_MIN")) { auto L=planner.limits(); L.corridor_scale_min=atof(getenv("WP_CORRIDOR_MIN")); planner.setLimits(L); }
    if (getenv("WP_HAIRPIN")) { auto L = planner.limits(); L.hairpin_rad = atof(getenv("WP_HAIRPIN")); planner.setLimits(L); }
    if (getenv("WP_VPIVOT"))  { auto L = planner.limits(); L.v_pivot     = atof(getenv("WP_VPIVOT"));  planner.setLimits(L); }
    const double corridor = getenv("WP_ACCEPT") ? atof(getenv("WP_ACCEPT")) : 1.0;
    /*
     * STOPS ARE PART OF THE PLAN (see BodyPathPlanner::addStopXY). The path
     * end always brakes to v_min (every mission finishes with a lie-down);
     * with a dash appended, the loop-closure waypoint - where the dog stops,
     * lies down and stands back up before the sprint - is a mid-path stop,
     * so the profile brakes into it and re-accelerates out of it with the
     * same two-pass math the corners use. Before this, the dog arrived at
     * both at full cruise and the stop sequence was really a crash-stop.
     */
    if (getenv("WP_END_BRAKE") && atoi(getenv("WP_END_BRAKE")) == 0)
      planner.setEndStop(false);
    if (dash_pending) {
      const auto& stopw = nav.waypoint(dash_wp_index - 1);
      planner.addStopXY(stopw.north, stopw.east);
      hold_stop_n[0] = stopw.north; hold_stop_e[0] = stopw.east;
      shmtrace::logf(0.0, "[plan] mid-path stop registered at the loop closure "
             "(wp%02d N=%.2f E=%.2f) for the dash interlude",
             dash_wp_index - 1, stopw.north, stopw.east);
    }
    /*
     * A NEAR-180 REVERSAL IS A STOP, and the profile cannot see it.
     * computeGeometry() estimates curvature from three consecutive path
     * points; on a course that doubles back along its own line (the
     * out-and-back dash) those three points are COLLINEAR, so kappa comes
     * out ~0 and the turnaround reads as a straight. Measured: the dash
     * held 3.00 m/s right into its own 180 and went over. Curvature cannot
     * express "reverse direction here" - a stop can, and the braking
     * machinery already exists. Only fires on courses that actually
     * reverse; star/oval/atom never do, so they are untouched.
     */
    for (size_t k = 1; k + 1 < wx.size(); ++k) {
      const double ax = wx[k] - wx[k-1], ay = wy[k] - wy[k-1];
      const double bx = wx[k+1] - wx[k], by = wy[k+1] - wy[k];
      const double la = std::hypot(ax, ay), lb = std::hypot(bx, by);
      if (la < 1e-6 || lb < 1e-6) continue;
      const double cosd = (ax*bx + ay*by) / (la * lb);
      if (cosd < -0.87) {          // direction change > 150 deg
        planner.addStopXY(wx[k], wy[k]);
        shmtrace::logf(0.0, "[plan] reversal at (%.1f, %.1f) registered as a stop "
               "(%.0f deg turn - curvature cannot see it)",
               wx[k], wy[k], std::acos(std::max(-1.0, cosd)) * 57.2958);
      }
    }
    hold_stop_n[1] = nav.waypoint(nav.count() - 1).north;
    hold_stop_e[1] = nav.waypoint(nav.count() - 1).east;
    planner.plan(wx, wy, 0.10, false, corridor);
    /*
     * ANALYSE THE MISSION ONCE, HERE, BEFORE THE DOG MOVES.
     *
     * Everything about a route that can be known is known now: the geometry is
     * fixed, so the curvature, the speed each point allows, which turns last
     * long enough to need a different gait, and where the time is actually
     * lost are all computable before the first step. Re-deriving any of it at
     * 50 Hz from a filtered estimate is strictly worse, and has already
     * produced a decider that could not tell a star vertex from an atom lobe.
     */
    planning::MissionPolicy pol;
    pol.kappa_min     = getenv("WP_REGIME_K")   ? atof(getenv("WP_REGIME_K"))   : pol.kappa_min;
    pol.sustained_m   = getenv("WP_REGIME_LEN") ? atof(getenv("WP_REGIME_LEN")) : pol.sustained_m;
    pol.min_switch_m  = getenv("WP_MIN_SWITCH") ? atof(getenv("WP_MIN_SWITCH")) : pol.min_switch_m;
    pol.gait_fast     = getenv("WP_GAIT_FAST")   ? atoi(getenv("WP_GAIT_FAST"))   : pol.gait_fast;
    pol.gait_sustained= getenv("WP_GAIT_CORNER") ? atoi(getenv("WP_GAIT_CORNER")) : pol.gait_sustained;
    pol.hbias_max     = getenv("WP_HBIAS")      ? atof(getenv("WP_HBIAS"))      : pol.hbias_max;
    pol.v_sustained_max = getenv("WP_VSUS") ? atof(getenv("WP_VSUS")) : pol.v_sustained_max;
    // ALWAYS analyse (the brief is free and worth having in every log), but
    // only ACT on it when asked. applyTo() imposes the sustained-curve speed
    // ceiling, which is a behaviour change - running it unconditionally made
    // the "bare" arm of an A/B not bare, and would have silently treated the
    // control group on every atom phase where sustained segments dominate.
    analyzer.analyze(planner, pol);
    if (use_analyzer) {
      // Two-pass: classify, impose the ceiling, re-plan, re-classify so the
      // printed brief is the plan the robot actually flies.
      analyzer.applyTo(planner, pol);
      analyzer.analyze(planner, pol);
    }
    analyzer.print();

    double kk, vv; planner.tightestCorner(&kk, &vv);
    shmtrace::logf(0.0, "[plan] %zu pts, %.1f m, tightest R=%.2f m -> %.2f m/s "
           "(cruise %.2f, a_lat %.2f, corridor %.2f)",
           planner.path().size(), planner.path().empty() ? 0.0 : planner.path().back().s,
           kk > 1e-6 ? 1.0/kk : 0.0, vv, lim.v_cruise, lim.a_lat_max, corridor);
  }

