MAVProxyUser/MITCheetahSTM31MP1-Claude/stm32mp1/gazebo/mit_sim_main.cpp
  /*
   * TAKE THE STICK OURSELVES, from LOCOMOTION entry - not by waiting for the
   * bridge's own straight-line ramp to finish, which is what used to run the
   * dog dead ahead for the whole delay+ramp window before nav ever steered
   * (see the WP_MISSION guard added around that ramp in
   * Stm32mp1HardwareBridge.cpp for the measured symptom and why it is wrong
   * for a mission specifically). Wait for control_mode == 4 (K_LOCOMOTION),
   * then hold the SAME gait-engage settle the old ramp used
   * ($SIM_VX_DELAY_S, still the standing-gait settle time, not a straight-line
   * hold) before calling nav.update() for the first time - the planner's own
   * accel limit (a_lon/a_accel_max) ramps speed from the standstill the robot
   * is actually at, while STEERING from tick one instead of after 15 s of
   * running straight.
   */
  while (bridge->getControlMode() != 4)
    std::this_thread::sleep_for(std::chrono::milliseconds(50));
  {
    float settle_s = getenv("SIM_VX_DELAY_S") ? atof(getenv("SIM_VX_DELAY_S")) : 3.f;
    shmtrace::logf(0.0, "[nav] LOCOMOTION engaged - holding %.1f s for the gait to settle "
           "before nav takes the stick", settle_s);
    std::this_thread::sleep_for(std::chrono::milliseconds((long)(settle_s * 1000.f)));
  }

  const auto t0 = std::chrono::steady_clock::now();
  auto elapsed = [&t0]() {
    return std::chrono::duration<float>(std::chrono::steady_clock::now() - t0).count();
  };
  shmtrace::logf(elapsed(), "[nav] taking the stick at t=%.1fs (mission %s)", elapsed(), mission);
  /*
   * Anchor for the forward-speed ramp below - NOT armed on the initial
   * takeover (restart_t starts a full ramp window in the past, so vscale is
   * 1.0 immediately). BodyPathPlanner::computeSpeedProfile() now forces
   * _path[0].v = 0 and ramps it forward itself with the SAME accel limit, so
   * applying a second, independent time-based ramp here on top of that
   * double-ramps and desyncs the caller's notion of "how far along the plan
   * am I" from the plan's own arc-length-based one - measured to cost the
   * star ~4 s and a visibly wide, arcing entry into its first corner (see
   * the comment at that _path[0].v = 0 assignment for the full account).
   * The dash interlude's stand-back-up IS a genuine standstill the
   * pre-computed profile does not know about (plan() is never called again
   * mid-mission), so THAT restart still arms this ramp for real.
   */
  const float vx_ramp_s = getenv("SIM_VX_RAMP_S") ? atof(getenv("SIM_VX_RAMP_S")) : 3.f;
  float restart_t = elapsed() - vx_ramp_s;

  /*
   * GAIT DECIDER ($WP_GAIT_DECIDER=1) - Apollo's task of the same name, using
   * the planner's curvature knowledge: run the FAST gait on straights and the
   * agile one through corners.
   *
   * The rule that makes it safe came from a controlled split, not a guess:
   *   switch gait, then accelerate             -> CROSSES (2/2)
   *   switch gait and accelerate together      -> CROSSES (30.3 s at 3.97 m/s)
   *   switch to a SLOWER-capable gait AT SPEED -> FAILS (2/2, ~35 m)
   * Only the last is dangerous. So the decider only ever switches while the
   * robot is ALREADY SLOW - which on a star is exactly the corner, where the
   * planner has braked for curvature anyway. Both directions then land in the
   * regime measured to work: drop to trotting while braking in, restore
   * trotRunning at the apex BEFORE accelerating out.
   */
  const bool gait_decider = getenv("WP_GAIT_DECIDER") && atoi(getenv("WP_GAIT_DECIDER")) != 0;
  /*
   * THREE TIERS, not a pair. There is no single transition rule and no reason
   * to force one: the course asks for different things and the gaits answer
   * differently, so the schedule is graded the same way the corner speed now is.
   *
   *   STRAIGHT  trotRunning (5)  40%% duty, flight phase - fastest, worst turner
   *   MIDDLE    trotting    (9)  50%% duty - the best all-rounder measured, and
   *                              the one to LEAN ON: it alone completes the star
   *                              at 2.0-2.5 m/s, 7/7
   *   TIGHT     walking    (20)  50%% duty 4-beat - slowest, most stable, for
   *                              the corners neither of the others survives
   *
   * Tiers are chosen from the PLANNED speed, which already encodes corner
   * angle through the angle-graded budget - so gait and speed grade together
   * instead of one fighting the other.
   */
  const int  gait_fast   = getenv("WP_GAIT_FAST")   ? atoi(getenv("WP_GAIT_FAST"))   : 5;
  const int  gait_corner = getenv("WP_GAIT_CORNER") ? atoi(getenv("WP_GAIT_CORNER")) : 9;
  const int  gait_tight  = getenv("WP_GAIT_TIGHT")  ? atoi(getenv("WP_GAIT_TIGHT"))  : 0;  // 0 = unused
  /*
   * $WP_GAIT_REGIME=1 switches the decider from "how slow is it ahead" to
   * "how LONG is the turn ahead" - see BodyPathPlanner::regimeAhead. kappa is
   * 1/R, so 0.15 is a 6.7 m radius; regime_len is the run length above which a
   * flight gait is judged unable to hold on.
   */
  /*
   * $WP_ANALYZER=1 hands gait and height-bias decisions to the pre-analysed
   * mission. `analyzer_lead` is how far ahead the robot reads - a gait change
   * needs its ~500 ms settling window BEFORE the corner, not in it.
   */
  const bool  regime_mode  = getenv("WP_GAIT_REGIME") && atoi(getenv("WP_GAIT_REGIME")) != 0;
  const float regime_kappa = getenv("WP_REGIME_K")   ? atof(getenv("WP_REGIME_K"))   : 0.15f;
  const float regime_len   = getenv("WP_REGIME_LEN") ? atof(getenv("WP_REGIME_LEN")) : 3.0f;
  const float v_tight    = getenv("WP_V_TIGHT")     ? atof(getenv("WP_V_TIGHT"))     : 1.1f;
  const float decide_v   = getenv("WP_GAIT_SWITCH_V") ? atof(getenv("WP_GAIT_SWITCH_V")) : 1.6f;
  /*
   * cur_gait MUST start as the gait the robot is ACTUALLY running, which is
   * cmpc_gait from the yaml - not gait_corner.
   *
   * Initialising it to gait_corner made the decider believe it was already in
   * the corner gait, so it never switched INTO it: the robot took every corner
   * in the fast gait and fell in the first one, while the log showed a single
   * no-op "switch" to the gait it was already in. That bug is why
   * trotting-straights/walking-corners looked like a dead end - the pairing was
   * never actually exercised.
   */
  int cur_gait = bridge->userParams()
      ? (int)((MIT_UserParameters*)bridge->userParams())->cmpc_gait
      : gait_corner;
  /*
   * LOOKAHEAD: switch on the curvature AHEAD, not underfoot. An animal changes
   * gait BEFORE the corner, while it still has time; deciding from the speed at
   * the current point means the decision arrives once already committed.
   */
  const float decide_ahead = getenv("WP_GAIT_LOOKAHEAD") ? atof(getenv("WP_GAIT_LOOKAHEAD")) : 4.0f;

  // Height pre-load for corners - see setHeightBias() below. Off by default so
  // the governor's own contribution can be measured before this stacks on it.
  const float hbias_gain  = getenv("WP_HBIAS")       ? atof(getenv("WP_HBIAS"))       : 0.0f;
  const float hbias_ahead = getenv("WP_HBIAS_AHEAD") ? atof(getenv("WP_HBIAS_AHEAD")) : 5.0f;

  const float dt = 0.02f;      // 50 Hz: the gait's own bandwidth is far below this
  float yaw_ref = NAN;
  int   lastIdx = -1;
  bool  done = false;
  // The bearing this dog was actually spawned facing, in the SAME compass
  // convention nav's own "bearing" variable below uses (0=north, positive
  // toward east) - mission_geometry.py's mission_opening_bearing_rad(),
  // computed once per launch and threaded through as degrees because that
  // is what every other env-var knob in this file already uses. Default 0
  // (north) reproduces the old universal-spawn-heading behaviour exactly
  // for anything that does not set it. See the "bearing" comment below for
  // why this is required, not optional, once spawn heading is mission-
  // dependent (WaypointNav::shiftFirstToOrigin() + mission_spawn_yaw_rad).
  const float spawn_bearing_rad =
      (getenv("WP_SPAWN_BEARING_DEG") ? atof(getenv("WP_SPAWN_BEARING_DEG")) : 0.0f)
      * (float)M_PI / 180.f;

  // ESTOP RECOVERY. See RobotController::isEstopped()'s comment for the
  // mechanism: MIT's stock FSM latches ESTOP forever on its own (a
  // deliberate real-hardware fail-safe - no self-reset without something
  // explicitly asking for one). Per direct instruction, built DELIBERATELY
  // this time, unlike the earlier host-stall mitigation that reacted to a
  // mere TIMING signal (a control-period spike that might not even cause a
  // real problem) and did active harm reacting to ordinary jitter - see
  // CLAUDE.md's "the stall MITIGATION was worse than the stall". This is
  // categorically different: it only ever engages on a CONFIRMED, already-
  // happened safety event (the FSM already cut the motors), never on a
  // prediction, and it reuses the SAME battle-tested boot sequence mission
  // start and the dash interlude already use - no new, unvalidated control
  // behaviour, no abrupt commands.
  const bool estop_recover_on =
      !getenv("WP_ESTOP_RECOVER") || atoi(getenv("WP_ESTOP_RECOVER")) != 0;
  const int max_estop_attempts =
      getenv("WP_ESTOP_MAX_ATTEMPTS") ? atoi(getenv("WP_ESTOP_MAX_ATTEMPTS")) : 3;
  int estop_attempts = 0;

  while (!done) {
    std::this_thread::sleep_for(std::chrono::milliseconds(20));
    if (!bridge->robotRunner()) continue;
    const auto& est = bridge->robotRunner()->getStateEstimate();

    SimAuxSensors aux;
    gazebo_get_aux(&aux);
    if (!nav.originSet()) {
      if (aux.gps_lat == 0.0) continue;
      nav.setOrigin(aux.gps_lat, aux.gps_lon);
      // Measured, not hardcoded pi/2 - see the "bearing" comment below for
      // why (works identically whether the estimator zeroes its own yaw or
      // reports true world yaw). spawn_bearing_rad is the separate
      // correction that makes this correct again now that spawn heading is
      // mission-specific rather than always north.
      yaw_ref = est.rpy[2];
      shmtrace::logf(elapsed(), "[nav] GPS origin set, heading datum %.1f deg (spawn bearing %.1f deg)",
             yaw_ref * 57.2958f, spawn_bearing_rad * 57.2958f);
    }

    if (estop_recover_on && bridge->robotRunner() &&
        bridge->robotRunner()->_robot_ctrl->isEstopped()) {
      if (estop_attempts >= max_estop_attempts) {
        // Give up rather than flail forever - leave it ESTOPped and let the
        // mission end normally (timeout / the harness's own zombie
        // detection). Retrying a genuinely broken situation N+1 times
        // buys nothing over N.
        std::this_thread::sleep_for(std::chrono::milliseconds(200));
        continue;
      }
      ++estop_attempts;
      shmtrace::logf(elapsed(), "[recover] ESTOP detected (attempt %d/%d) - waiting for a safe, "
             "settled orientation before attempting to stand back up",
             estop_attempts, max_estop_attempts);
      {
        const auto& re = est;   // the SAME estimate that triggered isEstopped() above
        const float rc4[4] = {(float)re.contactEstimate[0], (float)re.contactEstimate[1],
                               (float)re.contactEstimate[2], (float)re.contactEstimate[3]};
        shmtrace::log("recover_wait", elapsed(), re.rpy[0], re.rpy[1], re.rpy[2],
                      re.omegaBody[0], re.omegaBody[1], re.omegaBody[2],
                      re.vBody[0], re.vBody[1], re.vBody[2], re.position[2],
                      (float)estop_attempts, 2, 1, rc4);
      }

      // 1. WAIT FOR SAFE AND SETTLED, bounded. A stand-up sequence assumes
      //    starting from a roughly-upright crouch, not from actually lying
      //    on its side - attempting one on a genuinely fallen robot is not
      //    "gentler", it is undefined. 30 deg is well under the debounced
      //    fall detector's own 50 deg trip and well under checkSafeOrientation's
      //    own limit, so "settled under 30" is a real margin, not a coin
      //    flip; held for 1 s so a robot still actively oscillating does
      //    not get judged safe on one lucky sample.
      const float SETTLE_DEG = 30.f, SETTLE_HOLD_S = 1.f, SETTLE_TIMEOUT_S = 15.f;
      const float wait_start = elapsed();
      float safe_since = -1.f;
      bool settled = false;
      while (elapsed() - wait_start < SETTLE_TIMEOUT_S) {
        if (bridge->robotRunner()) {
          const auto& es = bridge->robotRunner()->getStateEstimate();
          const float r = std::fabs(es.rpy[0]) * 57.2958f;
          const float p = std::fabs(es.rpy[1]) * 57.2958f;
          if (r < SETTLE_DEG && p < SETTLE_DEG) {
            if (safe_since < 0.f) safe_since = elapsed();
            if (elapsed() - safe_since > SETTLE_HOLD_S) { settled = true; break; }
          } else {
            safe_since = -1.f;
          }
        }
        std::this_thread::sleep_for(std::chrono::milliseconds(100));
      }

      if (!settled) {
        shmtrace::logf(elapsed(), "[recover] gave up after %.0fs - orientation never settled "
               "under %.0f deg, this looks like a genuine fall rather than "
               "a transient trip. Leaving it ESTOPped.",
               SETTLE_TIMEOUT_S, SETTLE_DEG);
        if (bridge->robotRunner()) {
          const auto& rg = bridge->robotRunner()->getStateEstimate();
          const float rc4[4] = {(float)rg.contactEstimate[0], (float)rg.contactEstimate[1],
                                 (float)rg.contactEstimate[2], (float)rg.contactEstimate[3]};
          shmtrace::log("recover_giveup", elapsed(), rg.rpy[0], rg.rpy[1], rg.rpy[2],
                        rg.omegaBody[0], rg.omegaBody[1], rg.omegaBody[2],
                        rg.vBody[0], rg.vBody[1], rg.vBody[2], rg.position[2],
                        SETTLE_TIMEOUT_S, 2, 1, rc4);
        }
        continue;
      }

      // 2. CLEAR THE ESTOP, then run the SAME boot sequence mission start
      //    and the dash interlude already use (PASSIVE -> STAND_UP ->
      //    BALANCE_STAND -> LOCOMOTION) - no new control behaviour.
      //    RobotController::Estop() is MIT_Controller's own existing
      //    override (_controlFSM->initialize()), which resets operatingMode
      //    to NORMAL and currentState to PASSIVE - previously only ever
      //    called by an operator's real E-stop button, never mid-mission.
      //    Suspend both stall/fall checks around our OWN commanded sequence
      //    for the identical reason the interlude suspends them around
      //    its stop/lie-down/stand-up - a transient wobble during the
      //    stand-up interpolation itself must not re-trip immediately.
      setFallZEnable(false);
      setOrientTripEnable(false);
      bridge->robotRunner()->_robot_ctrl->Estop();
      setEdamp(0.0);
      setStandUpHeight(0.25);
      bridge->setControlMode(1);                 // K_STAND_UP
      std::this_thread::sleep_for(std::chrono::milliseconds(2500));
      bridge->setControlMode(3);                 // K_BALANCE_STAND
      std::this_thread::sleep_for(std::chrono::milliseconds(1500));
      bridge->setControlMode(4);                 // K_LOCOMOTION
      std::this_thread::sleep_for(std::chrono::milliseconds(1000));

      const auto& es3 = bridge->robotRunner()->getStateEstimate();
      const float rec_z = es3.position[2];
      const float rec_roll  = std::fabs(es3.rpy[0]) * 57.2958f;
      const float rec_pitch = std::fabs(es3.rpy[1]) * 57.2958f;
      const bool recovered = rec_z > 0.20f && rec_roll < 20.f && rec_pitch < 20.f;
      setFallZEnable(true);
      setOrientTripEnable(true);

      {
        const float rc4[4] = {(float)es3.contactEstimate[0], (float)es3.contactEstimate[1],
                               (float)es3.contactEstimate[2], (float)es3.contactEstimate[3]};
        shmtrace::log(recovered ? "recover_ok" : "recover_fail", elapsed(),
                      es3.rpy[0], es3.rpy[1], es3.rpy[2],
                      es3.omegaBody[0], es3.omegaBody[1], es3.omegaBody[2],
                      es3.vBody[0], es3.vBody[1], es3.vBody[2], rec_z,
                      (float)estop_attempts, recovered ? 0 : 2, 1, rc4);
      }
      if (recovered) {
        restart_t = elapsed();   // ramp forward speed again from this standstill, not a step
        shmtrace::logf(elapsed(), "[recover] back on its feet at t=%.1fs (z=%.3f roll=%.1f pitch=%.1f) "
               "- resuming mission at wp%02d of %d",
               elapsed(), rec_z, rec_roll, rec_pitch, nav.activeIndex(), nav.count());
      } else {
        shmtrace::logf(elapsed(), "[recover] stand-up did not verify (z=%.3f roll=%.1f pitch=%.1f) - "
               "will retry if attempts remain", rec_z, rec_roll, rec_pitch);
      }
      continue;
    }

    float N, E;
    nav.toLocal(aux.gps_lat, aux.gps_lon, &N, &E);
    // Compass bearing (0 = north, positive toward east). -(rpy[2] - yaw_ref)
    // alone gives bearing RELATIVE TO SPAWN HEADING, not relative to true
    // north - deliberately measured rather than a hardcoded pi/2, so this
    // still works identically whether the estimator zeroes its yaw
    // (VectorNav path) or reports true world yaw (cheater path), which
    // differ by exactly this constant. That was invisible for a long time
    // because every mission used to spawn facing due north, so "relative to
    // spawn" and "relative to true north" were silently the same number.
    // They no longer are: WaypointNav::shiftFirstToOrigin() means the robot
    // now spawns ON wp0 for every mission, and mission_spawn_yaw_rad()
    // (mission_geometry.py) faces it at wp1 instead of north so the first
    // real leg needs no in-place hairpin - so spawn heading is mission-
    // specific now, and nav's OWN target bearings (computed from wp0/wp1
    // north/east coordinates) are still in the TRUE-NORTH frame regardless.
    // Caught live: the star mission spawned facing 162 degrees off north,
    // "relative to spawn" read 0 at t=0 same as always, and the dog walked
    // a confident, perfectly straight line 180 degrees away from wp1 for
    // the entire run. spawn_bearing_rad (WP_SPAWN_BEARING_DEG, the exact
    // same bearing mission_spawn_yaw_rad used to aim the spawn pose) is the
    // fixed correction: it is 0 for the old universal-north convention (so
    // this reproduces the previous behaviour exactly when unset) and the
    // real opening bearing otherwise.
    const float bearing = spawn_bearing_rad - (est.rpy[2] - yaw_ref);
    const float spd = sqrtf(est.vBody[0] * est.vBody[0] + est.vBody[1] * est.vBody[1]);

    float nv = 0.f, nw = 0.f;
    // NAV owns mission state (arrival tests, waypoint advance, completion); the
    // planner only supplies the COMMANDS. Letting the planner's end-of-path
    // decide completion would end the mission wherever the smoothed path ran
    // out, which is not where the waypoints are.
    bool running = nav.update(N, E, bearing, spd, dt, &nv, &nw);
    if (use_planner) {
      double pv = 0, pw = 0;
      if (planner.follow(N, E, bearing, &pv, &pw)) { nv = (float)pv; nw = (float)pw; }
    }

