MAVProxyUser/MITCheetahSTM31MP1-Claude/stm32mp1/gazebo/mit_sim_main.cpp
    /*
     * PRE-LOAD STANCE HEIGHT FOR THE CORNER AHEAD. The controller's height
     * governor regulates height reactively off the robot's own state; this is
     * the planner telling it, ahead of time, that the ground is about to ask
     * for more. $WP_HBIAS is metres of extra height at full lateral budget
     * (0 = planner stays out of it and the governor runs purely reactive).
     */
    /*
     * READ THE ANNOTATED MISSION. A lookup, not a computation: the segment
     * `lead` metres ahead already carries the gait to be in and the stance
     * height to have pre-loaded by the time the demand arrives.
     */
    const planning::MissionSegment* seg = nullptr;
    if (use_analyzer && use_planner)
      seg = analyzer.segmentAhead(planner.currentS(), analyzer_lead);
    if (seg) setHeightBias(seg->height_bias);
    else if (use_planner && hbias_gain > 0.f)
      setHeightBias(planner.plannedHeightBias(hbias_ahead, hbias_gain));

    /*
     * NO GAIT CHANGES INSIDE A STOP'S BRAKING ZONE. Measured on the oval:
     * the analyzer upgrades trotting -> trotRunning entering the closing
     * straight ~3 s before the loop-closure STOP, so the stop maneuver
     * begins from a barely-engaged flight-phase gait - and that stop was
     * the one physically tipping sideways (~1 in 3, roll 72-88 deg) while
     * the star's and atom's stops (no switch on approach) passed cleanly.
     * Hold any pending change while within R_HOLD of a stop still ahead;
     * once the stop is consumed (interlude done -> dash_pending false and
     * the dog drives away), the held segment gait applies on the next
     * pass - which is exactly how the dash still gets trotRunning, just
     * AFTER standing back up instead of right before lying down.
     */
    bool near_stop = false;
    {
      // Distance alone is ambiguous on a CLOSED course - the dog spawns
      // next to the closure coordinates, and a bare radius test would
      // hold the analyzer's very first upgrade at mission start. Require
      // the mission to be past halfway before a stop can be "ahead".
      // 16, not 10: the oval's pre-dash stop moved 7.2 m up the straight
      // (the run-in), which put the closing straight's trotting ->
      // trotRunning upgrade OUTSIDE a 10 m hold - it fired 3.7 s before
      // the stop, mid-braking, and the stop went 0-for-4 (tips at roll
      // 41-78) where the held configuration was 5-of-6. The hold must
      // cover run-in + braking zone; the held switch still applies while
      // standing after the stand-up, which is the verified-clean path.
      const float R_HOLD = 16.f;
      const bool second_half = lastIdx > nav.count() / 2;
      if (dash_pending && second_half &&
          std::hypot(N - hold_stop_n[0], E - hold_stop_e[0]) < R_HOLD)
        near_stop = true;
      if (second_half &&
          std::hypot(N - hold_stop_n[1], E - hold_stop_e[1]) < R_HOLD)
        near_stop = true;
    }

    /*
     * OPEN THE STOP WINDOW ON THE BRAKING APPROACH, not at arrival. The
     * zero-debounce orientation ESTOP tripped on a genuine 28.6 deg
     * arrival wobble braking hard into the star's closure (loop clean at
     * 3.34 ms - no stall) in the instant BEFORE the interlude's own
     * suspend executed, cutting the motors mid-stop and leaving a zombie
     * the debounced detector never saw (flat-ish at ~30-45 deg never
     * crosses its 50 deg trip). Inside a stop's hold radius the stop is
     * already commanded in every sense that matters - gait changes are
     * held here for the same reason - so the debounced detector is the
     * arbiter from here through stand-up. Re-armed the moment the dog is
     * driving outside any stop radius.
     */
    if (near_stop) setOrientTripEnable(false);
    else if (running) setOrientTripEnable(true);

    if (seg && bridge->userParams() && seg->gait != cur_gait && !near_stop) {
      ControlParameterValue cv; cv.d = (double)seg->gait;
      bridge->userParams()->collection.lookup("cmpc_gait")
          .set(cv, ControlParameterValueKind::DOUBLE);
      shmtrace::logf(elapsed(), "[mission] gait %d -> %d entering %s at s=%.1f (R=%.2f, cost %+.2f s) t=%.1fs",
             cur_gait, seg->gait,
             seg->regime == 2 ? "SUSTAINED" : (seg->regime == 1 ? "transient" : "straight"),
             seg->s0, seg->radius_min, seg->time_cost, elapsed());
      cur_gait = seg->gait;
    }

    if (gait_decider && !use_analyzer && use_planner && bridge->userParams()) {
      // Slowest planned speed within decide_ahead metres: if a corner is
      // coming, commit to the corner gait NOW, while still able to.
      const double vplan = planner.minPlannedSpeedAhead(decide_ahead);
      int want;
      if (regime_mode) {
        /*
         * DECIDE ON THE DURATION OF THE TURN, NOT ITS SEVERITY.
         *
         * The old rule below keys off planned SPEED, which reads a star vertex
         * and an atom lobe identically - and they want opposite gaits.
         * trotRunning is 32/32 on the star (whose corners are over in a metre)
         * and 3/8 on the atom (whose curvature is held for ten-plus metres).
         * regimeAhead() separates them by how long the turn lasts.
         */
        const int reg = planner.regimeAhead(decide_ahead, regime_kappa, regime_len);
        want = (reg == 2) ? gait_corner : gait_fast;
      }
      else if (vplan >= 2.2)                      want = gait_fast;
      else if (gait_tight > 0 && vplan < v_tight) want = gait_tight;
      else                                        want = gait_corner;
      /*
       * THE GATE IS ASYMMETRIC, because the risk is.
       *
       *   -> trotRunning (flight gait) at 2.63 m/s : FATAL (fell instantly)
       *   -> trotRunning at 1.2 m/s                : fine, 2/2
       *   -> walking  at 2.0 m/s                   : fine, 2/2
       *   -> trotting at 2.0 m/s                   : fine, 1/1
       *
       * Dropping to a MORE STABLE gait is safe at speed; climbing to a flight
       * gait is not. A symmetric gate blocked the drop until the robot had
       * already braked to 1.6 m/s - which on this course is the corner apex,
       * far too late - so it entered every corner still in the fast gait and
       * fell. Going UP still waits for low speed; going DOWN may happen
       * whenever the target gait can hold the current speed.
       */
      // Dropping to the stable gait is UNGATED. The only measured danger is
      // climbing to a flight gait at speed; nothing in the data says a
      // down-switch is unsafe (walking at 2.0: 2/2, trotting at 2.0: 1/1).
      // Gating the drop by the target gait's COMMAND ceiling was wrong twice
      // over: trotRunning at 3.0 commanded actually cruises at 3.6 m/s, so a
      // 3.1 gate blocked the drop entirely and the robot entered every corner
      // still in the flight gait - the exact failure the decider exists to
      // prevent.
      // "Down" means toward the more stable end of the ladder
      // (trotRunning -> trotting -> walking); only climbing toward a flight
      // gait is speed-gated, because that is the only direction measured to
      // fail (fatal at 2.63 m/s, fine at 1.2).
      auto tierOf = [&](int g){ return g == gait_fast ? 2 : (g == gait_tight ? 0 : 1); };
      const bool going_down = tierOf(want) < tierOf(cur_gait);
      const bool may_switch = going_down ? true : (spd < decide_v);
      { static int gdbg = 0;
        if ((++gdbg % 50) == 0)
          shmtrace::logf(elapsed(), "[gaitdbg] vplan=%.2f want=%d cur=%d spd=%.2f down=%d may=%d",
                 vplan, want, cur_gait, spd, (int)going_down, (int)may_switch);
      }
      if (want != cur_gait && may_switch) {
        ControlParameterValue cv; cv.d = (double)want;
        bridge->userParams()->collection.lookup("cmpc_gait")
            .set(cv, ControlParameterValueKind::DOUBLE);
        shmtrace::logf(elapsed(), "[gait] %d -> %d at v=%.2f (planned %.2f) t=%.1fs",
               cur_gait, want, spd, vplan, elapsed());
        cur_gait = want;
      }
    }

    if (nav.activeIndex() != lastIdx) {
      lastIdx = nav.activeIndex();
      shmtrace::logf(elapsed(), "[nav] -> wp%02d of %d  t=%.1fs", lastIdx, nav.count(), elapsed());
    }

